[
    {
        "id": 1,
        "name": "Stock Cluster Pro - AI-Powered Stock Grouping Tool",
        "description": "Automatically analyze and group stocks based on their price movements using advanced PCA and hierarchical clustering. This tool processes historical stock data from Google Sheets, applies dimensionality reduction with PCA, and intelligently clusters stocks into hierarchical groups for portfolio analysis. Ideal for investors and analysts looking to identify correlated assets and diversify their portfolios.",
        "price": "US$5",
        "image": "https://images.unsplash.com/photo-1556742049-0cfed4f6a45d?w=400&h=300&fit=crop",
        "documentationLink": "https://example.com/docs/ecommerce",
        "stripeLink": "https://buy.stripe.com/your-stripe-link-1"
    },
    {
        "id": 2,
        "name": "Pair Trading Backtest Notebook",
        "description": "Automatically selects top cointegrated forex pairs using statistical tests (ADF, half-life, correlation), computes hedge ratios, and executes trades based on z-score thresholds. Fully editable and ready for customization. Ideal for quant traders and researchers.",
        "price": "US$5",
        "image": "https://images.unsplash.com/photo-1551288049-bebda4e38f71?w=400&h=300&fit=crop",
        "documentationLink": "https://example.com/docs/admin-dashboard",
        "stripeLink": "https://buy.stripe.com/your-stripe-link-2"
    },
    {
        "id": 3,
        "name": "Candlestick Pattern Backtester",
        "description": "Unlock the power of algorithmic trading with our sophisticated Candlestick Pattern Backtester. This powerful Python engine automatically scans, tests, and identifies the most profitable candlestick trading strategies for any stock, giving you a data-driven edge in the markets.",
        "price": "US$5",
        "image": "https://images.unsplash.com/photo-1512941937669-90a1b58e7e9c?w=400&h=300&fit=crop",
        "stripeLink": "https://buy.stripe.com/your-stripe-link-3"
    },
    {
        "id": 4,
        "name": "The Strategy Stress-Tester",
        "description": "Eliminate guesswork and avoid costly strategy failures. This isn't just code; it's a complete system to pressure-test your trading ideas. Our Python framework runs your strategies through the most brutal market environments, providing a clear "resume" of performance. You get a full breakdown of returns, drawdowns, and Sharpe ratios for each period. Includes a smart strategy combiner to find powerful synergies. Stop wondering if your strategy will hold up. Know for sure.",
        "price": "US$5",
        "image": "https://images.unsplash.com/photo-1504384308090-c894fdcc538d?w=400&h=300&fit=crop",
        "documentationLink": "https://example.com/docs/ui-components",
        "stripeLink": "https://buy.stripe.com/your-stripe-link-4"
    },
    {
        "id": 5,
        "name": "Algorithmic Trading Strategy Backtester - Multi-Period Validator",
        "description": "Automate your trading research. This advanced Python tool dynamically tests and identifies the most robust, high-performing trading strategies across multiple market conditions (bull/bear markets). It goes beyond simple backtesting by validating strategy consistency over 7 time periods, providing detailed trade logs, performance analytics, and actionable insights to help you build a more reliable trading system",
        "price": "US$5",
        "image": "https://images.unsplash.com/photo-1498050108023-c5249f4df085?w=400&h=300&fit=crop",
        "documentationLink": "https://example.com/docs/market-sentiment",
        "stripeLink": "https://buy.stripe.com/your-stripe-link-5"
    },
    {
        "id": 6,
        "name": "Double Bottom Pattern Pro - Automated Trading Strategy",
        "description": "Unlock the power of technical analysis with our Double Bottom Pattern Pro — a sophisticated, automated trading system designed to identify and capitalize on one of the most reliable reversal patterns in the stock market. This strategy automatically spots double bottom formations, generates precise buy signals at neckline breakouts, and manages risk with a built-in 10% stop loss.",
        "price": "US$5",
        "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?w=400&h=300&fit=crop",
        "documentationLink": "https://example.com/docs/trading-bot",
        "stripeLink": "https://buy.stripe.com/your-stripe-link-6"
    }
]